// ----------------------------------------------------------------------
/**
 * 🔍 함수를 이용한 부분 문자열의 위치 구하기 | O | 24.05.19 🔍
 *
 * [함수]
 */
let [a, b] = require("fs")
  .readFileSync("/dev/stdin")
  .toString()
  .trim()
  .split("\n");

function matchStr() {
    for(let i = 0; i < a.length; i++) {
        let cnt = 0;
        if(a[i] === b[0]) {
            for(let j = 0; j < b.length; j++) {
                if(a[i + j] === b[j]) cnt++;
            }
            if(cnt === b.length) {
                return i;
            }
        }
    }
    return -1;
}

console.log(matchStr());

// ----------------------------------------------------------------------
/**
 * 🔍 두 정수에 대한 연산값2 | O | 24.05.20 🔍
 *
 * [함수]
 */

// ----------------------------------------------------------------------
/**
 * 🔍 두 정수에 대한 연산값2 | O | 24.05.20 🔍
 *
 * [함수]
 */